app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 10 LIMIT 1
INSERT INTO "comments" ("created_at", "post_id", "text", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-04-23 04:19:01.058648"], ["post_id", 14], ["text", "テストコメント"], ["updated_at", "2026-04-23 04:19:01.058648"], ["user_id", 32]]