app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ('てすと', 'てすと', '2026-04-21 07:52:42.729563', '2026-04-21 07:52:42.729563', NULL) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

UPDATE "posts" SET "updated_at" = '2026-04-22 08:15:33.061422', "catchcopy" = 'てすと' WHERE "posts"."id" = 6
---
  def update
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 6 AND "posts"."id" = 2 LIMIT 1
---
  def set_own_post
    @post = current_user.posts.find_by(id: params[:id])